---------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\isf110 lab 4\Log\LOG auto -17 Feb 2022.log
  log type:  text
 opened on:  17 Feb 2022, 10:24:10

. 
. 
. *First, describe your data by using the following command:
. 
. describe

Contains data from C:\Program Files\Stata16\ado\base/a/auto.dta
  obs:            74                          1978 Automobile Data
 vars:            12                          13 Apr 2018 17:45
                                              (_dta has notes)
---------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------
make            str18   %-18s                 Make and Model
price           int     %8.0gc                Price
mpg             int     %8.0g                 Mileage (mpg)
rep78           int     %8.0g                 Repair Record 1978
headroom        float   %6.1f                 Headroom (in.)
trunk           int     %8.0g                 Trunk space (cu. ft.)
weight          int     %8.0gc                Weight (lbs.)
length          int     %8.0g                 Length (in.)
turn            int     %8.0g                 Turn Circle (ft.)
displacement    int     %8.0g                 Displacement (cu. in.)
gear_ratio      float   %6.2f                 Gear Ratio
foreign         byte    %8.0g      origin     Car type
---------------------------------------------------------------------------------------------------------------------------
Sorted by: foreign

. 
. *Look at the number of observations and variable labels. You should also notice that the dataset has notes attached: (_dt
> a has notes). Type the following to see the notes:
. 
. notes

_dta:
  1.  from Consumer Reports with permission

. 
. *Have a feel of the data by clicking on the Data Editor (Browse) button, or by selecting Data > Data Editor > Data Editor
>  (Browse) from the menus or by typing the command:
. 
. browse

. 
. /*A dataset is far more than simply the data it contains. It is also information that makes the data usable by someone ot
> her than the original creator.
> 
> Although describing the data tells us something about the structure of the data, it says little about the data themselves
> . For this, we need summary statistics. We can get them using different commands. Try this first: */
. 
. codebook

---------------------------------------------------------------------------------------------------------------------------
make                                                                                                         Make and Model
---------------------------------------------------------------------------------------------------------------------------

                  type:  string (str18), but longest is str17

         unique values:  74                       missing "":  0/74

              examples:  "Cad. Deville"
                         "Dodge Magnum"
                         "Merc. XR-7"
                         "Pont. Catalina"

               warning:  variable has embedded blanks

---------------------------------------------------------------------------------------------------------------------------
price                                                                                                                 Price
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [3291,15906]                 units:  1
         unique values:  74                       missing .:  0/74

                  mean:   6165.26
              std. dev:    2949.5

           percentiles:        10%       25%       50%       75%       90%
                              3895      4195    5006.5      6342     11385

---------------------------------------------------------------------------------------------------------------------------
mpg                                                                                                           Mileage (mpg)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [12,41]                      units:  1
         unique values:  21                       missing .:  0/74

                  mean:   21.2973
              std. dev:    5.7855

           percentiles:        10%       25%       50%       75%       90%
                                14        18        20        25        29

---------------------------------------------------------------------------------------------------------------------------
rep78                                                                                                    Repair Record 1978
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1,5]                        units:  1
         unique values:  5                        missing .:  5/74

            tabulation:  Freq.  Value
                             2  1
                             8  2
                            30  3
                            18  4
                            11  5
                             5  .

---------------------------------------------------------------------------------------------------------------------------
headroom                                                                                                     Headroom (in.)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [1.5,5]                      units:  .1
         unique values:  8                        missing .:  0/74

            tabulation:  Freq.  Value
                             4  1.5
                            13  2
                            14  2.5
                            13  3
                            15  3.5
                            10  4
                             4  4.5
                             1  5

---------------------------------------------------------------------------------------------------------------------------
trunk                                                                                                 Trunk space (cu. ft.)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [5,23]                       units:  1
         unique values:  18                       missing .:  0/74

                  mean:   13.7568
              std. dev:    4.2774

           percentiles:        10%       25%       50%       75%       90%
                                 8        10        14        17        20

---------------------------------------------------------------------------------------------------------------------------
weight                                                                                                        Weight (lbs.)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [1760,4840]                  units:  10
         unique values:  64                       missing .:  0/74

                  mean:   3019.46
              std. dev:   777.194

           percentiles:        10%       25%       50%       75%       90%
                              2020      2240      3190      3600      4060

---------------------------------------------------------------------------------------------------------------------------
length                                                                                                         Length (in.)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [142,233]                    units:  1
         unique values:  47                       missing .:  0/74

                  mean:   187.932
              std. dev:   22.2663

           percentiles:        10%       25%       50%       75%       90%
                               157       170     192.5       204       218

---------------------------------------------------------------------------------------------------------------------------
turn                                                                                                     Turn Circle (ft.) 
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [31,51]                      units:  1
         unique values:  18                       missing .:  0/74

                  mean:   39.6486
              std. dev:   4.39935

           percentiles:        10%       25%       50%       75%       90%
                                34        36        40        43        45

---------------------------------------------------------------------------------------------------------------------------
displacement                                                                                         Displacement (cu. in.)
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (int)

                 range:  [79,425]                     units:  1
         unique values:  31                       missing .:  0/74

                  mean:   197.297
              std. dev:   91.8372

           percentiles:        10%       25%       50%       75%       90%
                                97       119       196       250       350

---------------------------------------------------------------------------------------------------------------------------
gear_ratio                                                                                                       Gear Ratio
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (float)

                 range:  [2.19,3.89]                  units:  .01
         unique values:  36                       missing .:  0/74

                  mean:   3.01486
              std. dev:   .456287

           percentiles:        10%       25%       50%       75%       90%
                              2.43      2.73     2.955      3.37      3.72

---------------------------------------------------------------------------------------------------------------------------
foreign                                                                                                            Car type
---------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  origin

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  0/74

            tabulation:  Freq.   Numeric  Label
                            52         0  Domestic
                            22         1  Foreign

. 
. /*Note if there are missing values in any variables. Also note the total number of observations, range, mean, SD, and med
> ian of each variable. Can you calculate the interpercentile or interquartile range from the data mpg? Answer the followin
> g questions based on your calculations.
> 
> No. of missing values for rep78: There are 5 missing repair records as of 1978. 
> 
> Median mpg: Median is the 50th percentile, which in this case is displayed as 20. 
> 
> The range between 25% and 75% for price: The difference between these two is 2147. */
. 
. di(6342 - 4195)
2147

. 
. *To use Stata as a calculator, type: display or the shortcut:
. 
. di  //For example, di 50-20


. 
. * Another useful command for getting a quick overview of a data file is the inspect command. It also shows frequency dist
> ributions in bar graphs.
. 
. inspect

make:  Make and Model                           Number of Observations
---------------------                  ---------------------------------------
                                             Total      Integers   Nonintegers
|                            Negative            -             -             -
|                            Zero                -             -             -
|                            Positive            -             -             -
|                                      -----------   -----------   -----------
|                            Total               -             -             -
|                            Missing            74
+----------------------                -----------
.             -9.0e+307                         74
   (0 unique value)

price:  Price                                   Number of Observations
-------------                          ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive           74            74             -
|  #                                   -----------   -----------   -----------
|  #                         Total              74            74             -
|  #   #   .   .   .         Missing             -
+----------------------                -----------
3291              15906                         74
  (74 unique values)

mpg:  Mileage (mpg)                             Number of Observations
-------------------                    ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #                     Zero                -             -             -
|      #                     Positive           74            74             -
|  #   #                               -----------   -----------   -----------
|  #   #   #                 Total              74            74             -
|  #   #   #   #   .         Missing             -
+----------------------                -----------
12                   41                         74
  (21 unique values)

rep78:  Repair Record 1978                      Number of Observations
--------------------------             ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|          #                 Positive           69            69             -
|          #   #                       -----------   -----------   -----------
|          #   #   #         Total              69            69             -
|  .   #   #   #   #         Missing             5
+----------------------                -----------
1                     5                         74
   (5 unique values)

headroom:  Headroom (in.)                       Number of Observations
-------------------------              ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|          #                 Positive           74            37            37
|  #   #   #                           -----------   -----------   -----------
|  #   #   #   #             Total              74            37            37
|  #   #   #   #   #         Missing             -
+----------------------                -----------
1.5                   5                         74
   (8 unique values)

trunk:  Trunk space (cu. ft.)                   Number of Observations
-----------------------------          ---------------------------------------
                                             Total      Integers   Nonintegers
|              #             Negative            -             -             -
|      #       #             Zero                -             -             -
|      #       #             Positive           74            74             -
|      #   #   #                       -----------   -----------   -----------
|  #   #   #   #   #         Total              74            74             -
|  #   #   #   #   #         Missing             -
+----------------------                -----------
5                    23                         74
  (18 unique values)

weight:  Weight (lbs.)                          Number of Observations
----------------------                 ---------------------------------------
                                             Total      Integers   Nonintegers
|  #       #                 Negative            -             -             -
|  #       #                 Zero                -             -             -
|  #   #   #   #             Positive           74            74             -
|  #   #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total              74            74             -
|  #   #   #   #   #         Missing             -
+----------------------                -----------
1760               4840                         74
  (64 unique values)

length:  Length (in.)                           Number of Observations
---------------------                  ---------------------------------------
                                             Total      Integers   Nonintegers
|              #             Negative            -             -             -
|      #       #             Zero                -             -             -
|      #       #             Positive           74            74             -
|      #   #   #                       -----------   -----------   -----------
|  #   #   #   #   #         Total              74            74             -
|  #   #   #   #   #         Missing             -
+----------------------                -----------
142                 233                         74
  (47 unique values)

turn:  Turn Circle (ft.)                        Number of Observations
-------------------------              ---------------------------------------
                                             Total      Integers   Nonintegers
|      #                     Negative            -             -             -
|      #       #             Zero                -             -             -
|      #   #   #             Positive           74            74             -
|      #   #   #                       -----------   -----------   -----------
|  #   #   #   #             Total              74            74             -
|  #   #   #   #   .         Missing             -
+----------------------                -----------
31                   51                         74
  (18 unique values)

displacement:  Displacement (cu. in.)           Number of Observations
-------------------------------------  ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero                -             -             -
|  #                         Positive           74            74             -
|  #       #                           -----------   -----------   -----------
|  #   #   #   #             Total              74            74             -
|  #   #   #   #   .         Missing             -
+----------------------                -----------
79                  425                         74
  (31 unique values)

gear_ratio:  Gear Ratio                         Number of Observations
-----------------------                ---------------------------------------
                                             Total      Integers   Nonintegers
|          #                 Negative            -             -             -
|          #                 Zero                -             -             -
|          #                 Positive           74             -            74
|  #   #   #       #                   -----------   -----------   -----------
|  #   #   #       #         Total              74             -            74
|  #   #   #   #   #         Missing             -
+----------------------                -----------
2.19               3.89                         74
  (36 unique values)

foreign:  Car type                              Number of Observations
------------------                     ---------------------------------------
                                             Total      Integers   Nonintegers
|  #                         Negative            -             -             -
|  #                         Zero               52            52             -
|  #                         Positive           22            22             -
|  #                                   -----------   -----------   -----------
|  #   #                     Total              74            74             -
|  #   #                     Missing             -
+----------------------                -----------
0                     1                         74
   (2 unique values)

      foreign is labeled and all values are documented in the label.

. 
. /*To get all the summary statistics in one table, simply type sum or on the menu bar, go to Statistics > Summaries, table
> s, and tests > Summary and descriptive statistics > Summary statistics and clicking on the OK button.
> 
> From this simple summary, we can learn a bit about the data. First of all, the prices are nothing like today’s car prices
> —of course, these cars are now antiques. We can see that the gas mileages are not particularly good—this is in 1978!*/
. 
. *We saw before that rep78 has some missing values. We can browse only those observations for which rep78 is missing, so w
> e could type:
. 
. browse if missing(rep78) // This command uses two new concepts for Stata commands—the if qualifier and the missing() func
> tion.

. 
. *The same ends could be achieved by typing:
. 
. list make if missing(rep78)

     +---------------+
     | make          |
     |---------------|
  3. | AMC Spirit    |
  7. | Buick Opel    |
 45. | Plym. Sapporo |
 51. | Pont. Phoenix |
 64. | Peugeot 604   |
     +---------------+

. 
. *We cannot impute missing values because we do not see any patterns here.
. 
. /* We saw above that the summarize command gave brief summary statistics about all the variables. Suppose now that we bec
> ame interested in the prices while summarizing the data because they seemed fantastically low (it was 1978, after all). T
> o get an in-depth look at the price variable, we can use the menus and a dialog:
> 1. Select Statistics > Summaries, tables, and tests > Summary and descriptive statistics >
> Summary statistics.
> 2. Enter or select price in the Variables field.
> 3. Select Display additional statistics.
> 4. Click on Submit.
> 
> Alternatively, typing summarize price, detail will get the same result. The portion after the comma contains options for 
> Stata commands; hence, detail is an example of an option. */
. 
. /* From the output, answer the following questions: 
> 
> The median price of the cars in the dataset is:  5006.5. We can look at the detailed breakdown of price to find the perce
> ntiles, and from there the 50th percentile. 
> 
> The four most expensive cars are all priced between: (13466,15906)
> 
> If we wished to browse the most expensive, we could start by clicking on the Data Editor (Browse) button. Once the Data E
> ditor is open, we can click on the Filter Observations button, to bring up the Filter Observations dialog. We can look at
>  the expensive cars by putting price > 13000 in the ‘Filter by expression’ field. 
> 
> Pressing the Apply Filter, list the four most expensive cars in 1978. 
> (FROM LEAST TO MOST EXPENSIVE)
> Linc. Versailles
> Linc. Mark V
> Cad. Eldorado
> Cad. Seville
> 
> Comment on their gas mileage and repair records. Besides, the seville, the other 3 most expensive cars have fairly low mp
> g, at least one sd below the mean. It's important to note however that mpg has a very high variance (approx 33), so this 
> isn't alarming. It also appears that most of them have average-quality repair records, besides the eldorado. The eldorado
>  rep78 rates at a 2, which is just slightly lower quality. All of the repair records are below the group average of 3.405
> 797. 
> 
> *We now decide to turn our attention to foreign cars, mileage and repairs.
> 
> *Let’s start by looking at the proportion of foreign cars in the dataset along with the proportion of cars with each type
>  of mileage and repair record. Type:*/
. 
. tab foreign

   Car type |      Freq.     Percent        Cum.
------------+-----------------------------------
   Domestic |         52       70.27       70.27
    Foreign |         22       29.73      100.00
------------+-----------------------------------
      Total |         74      100.00

. 
. *What percentage of cars is foreign made? What percentage of cars is domestic? 29.73 percent of the cars are foreign made
> . 
. 
. tab mpg

    Mileage |
      (mpg) |      Freq.     Percent        Cum.
------------+-----------------------------------
         12 |          2        2.70        2.70
         14 |          6        8.11       10.81
         15 |          2        2.70       13.51
         16 |          4        5.41       18.92
         17 |          4        5.41       24.32
         18 |          9       12.16       36.49
         19 |          8       10.81       47.30
         20 |          3        4.05       51.35
         21 |          5        6.76       58.11
         22 |          5        6.76       64.86
         23 |          3        4.05       68.92
         24 |          4        5.41       74.32
         25 |          5        6.76       81.08
         26 |          3        4.05       85.14
         28 |          3        4.05       89.19
         29 |          1        1.35       90.54
         30 |          2        2.70       93.24
         31 |          1        1.35       94.59
         34 |          1        1.35       95.95
         35 |          2        2.70       98.65
         41 |          1        1.35      100.00
------------+-----------------------------------
      Total |         74      100.00

. tab rep78

     Repair |
Record 1978 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        2.90        2.90
          2 |          8       11.59       14.49
          3 |         30       43.48       57.97
          4 |         18       26.09       84.06
          5 |         11       15.94      100.00
------------+-----------------------------------
      Total |         69      100.00

. 
. *Note: 1 means a poor repair record and 5 means a good one. 
. 
. * These one-way tables do not help us compare the mileage and repair records of foreign and domestic cars. A two-way tabl
> e would help greatly. Type:
. 
. tab rep78 foreign, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Repair |
    Record |       Car type
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         2 |         8          0 |         8 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         3 |        27          3 |        30 
           |     90.00      10.00 |    100.00 
-----------+----------------------+----------
         4 |         9          9 |        18 
           |     50.00      50.00 |    100.00 
-----------+----------------------+----------
         5 |         2          9 |        11 
           |     18.18      81.82 |    100.00 
-----------+----------------------+----------
     Total |        48         21 |        69 
           |     69.57      30.43 |    100.00 

. tab rep78 foreign, col  //See the difference with row percentages

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Repair |
    Record |       Car type
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
           |      4.17       0.00 |      2.90 
-----------+----------------------+----------
         2 |         8          0 |         8 
           |     16.67       0.00 |     11.59 
-----------+----------------------+----------
         3 |        27          3 |        30 
           |     56.25      14.29 |     43.48 
-----------+----------------------+----------
         4 |         9          9 |        18 
           |     18.75      42.86 |     26.09 
-----------+----------------------+----------
         5 |         2          9 |        11 
           |      4.17      42.86 |     15.94 
-----------+----------------------+----------
     Total |        48         21 |        69 
           |    100.00     100.00 |    100.00 

. 
. tab mpg foreign, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

   Mileage |       Car type
     (mpg) |  Domestic    Foreign |     Total
-----------+----------------------+----------
        12 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        14 |         5          1 |         6 
           |     83.33      16.67 |    100.00 
-----------+----------------------+----------
        15 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        16 |         4          0 |         4 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        17 |         2          2 |         4 
           |     50.00      50.00 |    100.00 
-----------+----------------------+----------
        18 |         7          2 |         9 
           |     77.78      22.22 |    100.00 
-----------+----------------------+----------
        19 |         8          0 |         8 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        20 |         3          0 |         3 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        21 |         3          2 |         5 
           |     60.00      40.00 |    100.00 
-----------+----------------------+----------
        22 |         5          0 |         5 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        23 |         0          3 |         3 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
        24 |         3          1 |         4 
           |     75.00      25.00 |    100.00 
-----------+----------------------+----------
        25 |         1          4 |         5 
           |     20.00      80.00 |    100.00 
-----------+----------------------+----------
        26 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
        28 |         2          1 |         3 
           |     66.67      33.33 |    100.00 
-----------+----------------------+----------
        29 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        30 |         1          1 |         2 
           |     50.00      50.00 |    100.00 
-----------+----------------------+----------
        31 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
        34 |         1          0 |         1 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
        35 |         0          2 |         2 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
        41 |         0          1 |         1 
           |      0.00     100.00 |    100.00 
-----------+----------------------+----------
     Total |        52         22 |        74 
           |     70.27      29.73 |    100.00 

. 
. *The tables are long and difficult to compare. Use:
. 
. sum rep78 if foreign==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rep78 |         48    3.020833     .837666          1          5

. sum rep78 if foreign==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rep78 |         21    4.285714    .7171372          3          5

. 
. sum mpg if foreign==0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         52    19.82692    4.743297         12         34

. sum mpg if foreign==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         22    24.77273    6.611187         14         41

. 
. *Note: We can reduce the lines of Stata command by writing: 
. 
. by foreign, sort : summarize mpg

---------------------------------------------------------------------------------------------------------------------------
-> foreign = Domestic

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         52    19.82692    4.743297         12         34

---------------------------------------------------------------------------------------------------------------------------
-> foreign = Foreign

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         22    24.77273    6.611187         14         41


. by foreign, sort : summarize rep78

---------------------------------------------------------------------------------------------------------------------------
-> foreign = Domestic

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rep78 |         48    3.020833     .837666          1          5

---------------------------------------------------------------------------------------------------------------------------
-> foreign = Foreign

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
       rep78 |         21    4.285714    .7171372          3          5


. 
. *Compare foreign cars with domestic cars in terms of repair records and mpg. WRITE A FEW SENTENCES HERE -> It appears tha
> t the foreign cars, on average, have both better mpg and better repair records. The average rep78 for a foreign car is ve
> ry high - a 4.29, while for the domestic it sits at a 3.02. The mpg is also higher, but the std is also higher for foreig
> n cars and we have a smaller number of observations, so my guess is that with more observations the mean mpgs would be mo
> re similar. 
. 
. *Now, we will do cross tabulation to produce some formatted tables. Type:*
. 
. tab foreign, summarize(mpg)

            |      Summary of Mileage (mpg)
   Car type |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   Domestic |   19.826923   4.7432972          52
    Foreign |   24.772727   6.6111869          22
------------+------------------------------------
      Total |   21.297297   5.7855032          74

. tab foreign, summarize(rep78)

            |    Summary of Repair Record 1978
   Car type |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   Domestic |   3.0208333   .83766604          48
    Foreign |   4.2857143   .71713717          21
------------+------------------------------------
      Total |   3.4057971   .98993227          69

. 
. tab rep78 foreign

    Repair |
    Record |       Car type
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
         2 |         8          0 |         8 
         3 |        27          3 |        30 
         4 |         9          9 |        18 
         5 |         2          9 |        11 
-----------+----------------------+----------
     Total |        48         21 |        69 

. tab rep78 foreign, column nofreq

    Repair |
    Record |       Car type
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |      4.17       0.00 |      2.90 
         2 |     16.67       0.00 |     11.59 
         3 |     56.25      14.29 |     43.48 
         4 |     18.75      42.86 |     26.09 
         5 |      4.17      42.86 |     15.94 
-----------+----------------------+----------
     Total |    100.00     100.00 |    100.00 

. 
. *Finally, we will see some correlations. Type:
. 
. cor
(make ignored because string variable)
(obs=69)

             |    price      mpg    rep78 headroom    trunk   weight   length     turn displa~t gear_r~o  foreign
-------------+---------------------------------------------------------------------------------------------------
       price |   1.0000
         mpg |  -0.4559   1.0000
       rep78 |   0.0066   0.4023   1.0000
    headroom |   0.1112  -0.3996  -0.1480   1.0000
       trunk |   0.3232  -0.5798  -0.1572   0.6608   1.0000
      weight |   0.5478  -0.8055  -0.4003   0.4795   0.6691   1.0000
      length |   0.4425  -0.8037  -0.3606   0.5240   0.7326   0.9478   1.0000
        turn |   0.3302  -0.7355  -0.4961   0.4347   0.6008   0.8610   0.8631   1.0000
displacement |   0.5479  -0.7434  -0.4119   0.4763   0.6287   0.9316   0.8621   0.8124   1.0000
  gear_ratio |  -0.3802   0.6565   0.4103  -0.3790  -0.5107  -0.7906  -0.7232  -0.7005  -0.8381   1.0000
     foreign |  -0.0174   0.4538   0.5922  -0.3347  -0.4053  -0.6460  -0.6110  -0.6768  -0.6383   0.7266   1.0000


. 
. *Interpret the correlation between weight and mpg, and foreign and rep78. What do the results say, when investigating col
> linearity among predictor variables for price? MPG significantly decreases as weight increases. There is a strong negativ
> e correlation there. There is a positive correlation between foreign and rep78, but I'm not certain that this indicates m
> uch. It's possible this could just suggest that a foreign car is more LIKELY to have a more extensive record, not neceses
> sarily that foreign car records are inherently better. 
. 
. 
. *End of Lab*
. 
. log close
      name:  <unnamed>
       log:  \\Client\C$\isf110 lab 4\Log\LOG auto -17 Feb 2022.log
  log type:  text
 closed on:  17 Feb 2022, 10:24:14
---------------------------------------------------------------------------------------------------------------------------
