------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\ISF_110\Lab 6  -.log
  log type:  text
 opened on:   3 Mar 2022, 09:28:47

. shp2dta using WB_countries_Admin0_10m, database(wb_data) coord(world_shp) ge
> nid (ID) replace
command shp2dta is unrecognized
r(199);

. ssc install shp2dta, replace
checking shp2dta consistency and verifying not already installed...
installing into c:\ado\plus\...
file c:\ado\plus\next.trk already exists
r(602);

. shp2dta using WB_countries_Admin0_10m, database(wb_data) coord(world_shp) ge
> nid (ID) replace
command shp2dta is unrecognized
r(199);

. save "\\Client\C$\ISF_110\Lab 6\Data\usdata.dta", replace
file \\Client\C$\ISF_110\Lab 6\Data\usdata.dta saved

.   .sysdir
invalid syntax
r(198);

. .sysdir
invalid syntax
r(198);

. .sysdir
invalid syntax
r(198);

. sysdir
   STATA:  C:\Program Files\Stata16\
    BASE:  C:\Program Files\Stata16\ado\base\
    SITE:  C:\Program Files\Stata16\ado\site\
    PLUS:  c:\ado\plus\
PERSONAL:  C:\Users\kc1558628\ado\personal\
OLDPLACE:  c:\ado\

. sysdir set PLUS "\\Client\C$\ISF_110"

. ssc install shp2dta, replace
checking shp2dta consistency and verifying not already installed...
installing into \\Client\C$\ISF_110\...
installation complete.

. ls
  <dir>   3/03/22  9:39  .                 
  <dir>   3/03/22  9:39  ..                
   0.0k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.cpg
 210.7k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.dbf
   0.1k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.prj
   4.3k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbn
   0.4k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbx
1245.5k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shp
   9.8k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shp.xml
   3.5k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shx

. shp2dta using WB_countries_Admin0_10m, database(wb_data) coord(world_shp) genid (ID) replace
file WB_countries_Admin0_10m.shp not found
r(601);

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data) coord(world_shp) genid (ID) replace
type: 3

. 
. 
. 
. 
. 
. use wb_data, clear

. 
. br

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000  //GDP estimates are given in millions of dollar
GDP_MD_EST not found
r(111);

end of do-file

r(111);

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000  //GDP estimates are given in millions of dollar
GDP_MD_EST not found
r(111);

. use "\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m\wb_data.dta", clear

. use "\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m\world_shp.dta", clear

. shp2dta using WB_countries_Admin0_10m, database(wb_data_KC) coord(world_shp) genid (ID) replace
file WB_countries_Admin0_10m.shp not found
r(601);

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data_KC) coord(world_shp) genid (ID) repl
> ace
type: 3

. use wb_data, clear

. 
. 
. 
. . 

. 
. . br

. use wb_data, clear

. use wb_data_KC, clear

. br

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data_KC) coord(world_shp) genid (ID) repl
> ace
type: 3

. br

. use wb_data_kc, clear

. br

. cd
\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m

. shp2dta using WB_countries_Admin0_10m, database(wb_data_kc_2) coord(world_shp) genid (ID) repla
> ce
file WB_countries_Admin0_10m.shp not found
r(601);

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data_KC_BCOURSES) coord(world_shp) genid 
> (ID) repla
option repla not allowed
r(198);

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data_KC_BCOURSES) coord(world_shp) genid 
> replace
option genid incorrectly specified
r(198);

. shp2dta using WB_Adm0_boundary_lines_10m, database(wb_data_KC_BCOURSES) coord(world_shp) genid 
> (ID) replace
type: 3

. use wb_data_KC_BCOURSES, clear

. br

. cd
\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m

. ls
  <dir>   3/03/22 10:05  .                 
  <dir>   3/03/22 10:05  ..                
   0.0k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.cpg
 210.7k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.dbf
   0.1k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.prj
   4.3k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbn
   0.4k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbx
1245.5k   3/03/22  9:54  WB_Adm0_boundary_lines_10m.shp
   9.8k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shp.xml
   3.5k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shx
  75.9k   3/03/22  9:41  wb_data.dta       
 210.7k   3/03/22  9:54  WB_Adm0_boundary_lines_10m (1).dbf
1486.8k   3/03/22  9:59  world_shp.dta     
  75.9k   3/03/22  9:59  wb_data_KC_BCOURSES.dta
 453.2k   3/03/22 10:04  WB_countries_Admin0_10m.dbf
8189.0k   3/03/22 10:04  WB_countries_Admin0_10m.shp

. shp2dta using WB_countries_Admin0_10m, database(wb_data) coord(world_shp) genid (ID) replace
type: 5

. use wb_data, clear

. 
. br

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000  //GDP estimates are given in millions of dollar
1000000/ invalid name
r(198);

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000
(2 missing values generated)

. gdp_pc
command gdp_pc is unrecognized
r(199);

.  gen gdp_pc = (GDP_MD_EST / POP_EST), replace
variable gdp_pc already defined
r(110);

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000
variable gdp_pc already defined
r(110);

. replace gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000
variable gen not found
r(111);

. gen gdp_pc = (GDP_MD_EST / POP_EST) * 1000000, replace
variable gdp_pc already defined
r(110);

. ssc install spmap, replace
checking spmap consistency and verifying not already installed...
installing into \\Client\C$\ISF_110\...
installation complete.

. spmap gdp_pc using world_shp, id(ID) fcolor(Blues)

. graph save "Graph" "\\Client\C$\ISF_110\Lab 6\Exports\Graph.gph"
(file \\Client\C$\ISF_110\Lab 6\Exports\Graph.gph saved)

. spmap gdp_pc using world_shp, id(ID) fcolor(Reds)

. set more off

. 
. clear all

. cd
\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m

. ls
  <dir>   3/03/22 10:15  .                 
  <dir>   3/03/22 10:15  ..                
 210.7k   3/03/22  9:54  WB_Adm0_boundary_lines_10m (1).dbf
   0.0k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.cpg
 210.7k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.dbf
   0.1k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.prj
   4.3k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbn
   0.4k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.sbx
1245.5k   3/03/22  9:54  WB_Adm0_boundary_lines_10m.shp
   9.8k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shp.xml
   3.5k   3/03/22  9:25  WB_Adm0_boundary_lines_10m.shx
 453.2k   3/03/22 10:04  WB_countries_Admin0_10m.dbf
8189.0k   3/03/22 10:04  WB_countries_Admin0_10m.shp
 456.7k   3/03/22 10:06  wb_data.dta       
  75.9k   3/03/22  9:59  wb_data_KC_BCOURSES.dta
9254.0k   3/03/22 10:06  world_shp.dta     

. cd
\\Client\C$\ISF_110\Lab 6\wb_adm0_boundary_lines_10m

. 
. \\Client\C$\ISF_110\Lab 6\Data
\ is not a valid command name
r(199);

. cd "\\Client\C$\ISF_110\Lab 6"
\\Client\C$\ISF_110\Lab 6

. ls
  <dir>   3/03/22 10:16  .                 
  <dir>   3/03/22 10:16  ..                
  <dir>   3/03/22  9:31  Data              
  <dir>   3/03/22  9:21  Do                
  <dir>   3/03/22  9:20  Docs              
  <dir>   3/03/22 10:06  wb_adm0_boundary_lines_10m
  <dir>   3/03/22 10:09  Exports           
 119.2k   3/03/22 10:14  Lab 6 Answers (KC Harris).docx
   0.2k   3/03/22 10:14  ~$b 6 Answers (KC Harris).docx

. cd Data
\\Client\C$\ISF_110\Lab 6\Data

. ls
  <dir>   3/03/22 10:16  .                 
  <dir>   3/03/22 10:16  ..                
 144.0k   3/03/22  9:14  uscoord.dta       
   9.1k   3/03/22  9:31  usdata.dta        
   5.1k   3/03/22  9:14  usdb.dta          
   3.2k   3/03/22  9:14  uslabelcoord.dta  

. use usdata, clear

. 
. ren subreg_id subreg

. 
. encode subreg, gen(subreg_id)

. keep subreg_id unhappy housing_price unemployment

. 
. 
. 
. merge 1:1 subreg_id using usdb.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 9  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. 
. 
. merge 1:1 subreg_id using uslabelcoord.dta
(note: variable subreg_id was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 9  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. spmap unhappy using uscoord.dta, id(subreg_id)

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. spmap unhappy using uscoord.dta, id(subreg_id)///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. 
. 
. 
. 
. 
. 
. 
. spmap unhappy using uscoord.dta, id(subreg_id)///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. set more off

. 
. clear all

. use usdata, clear

. 
. ren subreg_id subreg

. 
. encode subreg, gen(subreg_id)

. 
. 
. 
. keep subreg_id unhappy housing_price unemployment

. 
. 
. 
. merge 1:1 subreg_id using usdb.dta

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 9  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. 
. 
. 
. merge 1:1 subreg_id using uslabelcoord.dta
(note: variable subreg_id was long, now double to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                 9  (_merge==3)
    -----------------------------------------

. 
. drop _merge

. spmap unhappy using uscoord.dta, id(subreg_id)///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. title("Figure 3: Unhappiness by Census Division, 2012")
command title is unrecognized
r(199);

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
.  br

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
option / not allowed
r(198);

. 
. label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  ///
invalid syntax
r(198);

. 
. fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
command fcolor is unrecognized
r(199);

. 
. 
. 
. 
. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. use "\\Client\C$\ISF_110\Lab 6\Data\usdata.dta"
no; dataset in memory has changed since last saved
r(4);

end of do-file

r(4);

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. spmap unhappy using uscoord.dta, id(subreg_id)///
option / not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. spmap unhappy using uscoord.dta, id(subreg_id) ///
> label(label(subreg_id) xcoord(xcoord) ycoord(ycoord)) ///
> fcolor(Reds) legtitle("Fraction of respondents who were unhappy") ///
> title("Figure 3: Unhappiness by Census Division, 2012")

. 
end of do-file

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. gen Y = housing_price

. format Y %4.1f 

. 
. spmap unhappy using uscoord.dta, id(subreg_id)///
option / not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. gen Y = housing_price
variable Y already defined
r(110);

end of do-file

r(110);

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
> point(x(xcoord) y(ycoord) proportional(Y) fcolor(red) ocolor(white) size(*3.5))  ///
> label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  /// 
> fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
> title("Figure 3: Housing Price and Unhappiness by Census Division, 2012")

. 
end of do-file

. br

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. gen Y = unemployment
variable Y already defined
r(110);

end of do-file

r(110);

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. gen unemployment_Y = unemployment

. format unemployment_Y %4.1f 

. 
. spmap unhappy using uscoord.dta, id(subreg_id)  ///
> point(x(xcoord) y(ycoord) proportional(unemployment_Y) fcolor(red) ocolor(white) size(*3.5))  /
> //
> label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  /// 
> fcolor(Reds) legtitle("Fraction of respondents who were unhappy")  ///
> title("Figure 3: Housing Price and Unhappiness by Census Division, 2012")

. 
end of do-file

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
> point(x(xcoord) y(ycoord) proportional(unemployment_Y) fcolor(red) ocolor(white) size(*3.5))  /
> //
> label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  /// 
> fcolor(Reds) legtitle("Fraction of respondents who were unemployed")  ///
> title("Figure 3: Unemployment Rates and Unhappiness by Census Division, 2012")

. 
end of do-file

. do "C:\Users\KC1558~1\AppData\Local\Temp\37\STD20ec_000000.tmp"

. spmap unhappy using uscoord.dta, id(subreg_id)  ///
> point(x(xcoord) y(ycoord) proportional(unemployment_Y) fcolor(red) ocolor(white) size(*3.5))  /
> //
> label(label(subreg_id) xcoord(xcoord) ycoord(ycoord))  /// 
> fcolor(Reds) legtitle("Fraction of respondents who were unemployed")  ///
> title("Figure 3: Unemployment Rates and Unhappiness by Census Division, 2012")

. 
end of do-file

. save "usdata.dta", replace
file usdata.dta saved

. exit
