--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Log\Log BPDSTOPS -22 Apr 2022.log
  log type:  text
 opened on:  22 Apr 2022, 19:43:02

. use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta"

. sysdir set PLUS "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110"

. // ssc install mcp2
. 
. 
. 
. 
. 
. gen race = 2 if perceived_race_or_ethnicity=="White"  
(39,773 missing values generated)

. replace race = 3 if perceived_race_or_ethnicity=="Black/African American" |  perceived_race_or_ethnicity=="Black"
(20,494 real changes made)

. replace race = 4 if perceived_race_or_ethnicity=="Hispanic/Latino" |  perceived_race_or_ethnicity=="Hispanic"
(8,156 real changes made)

. replace race = 5 if perceived_race_or_ethnicity=="Asian"   
(4,759 real changes made)

. replace race = 1 if !inlist(race,1,2,3,4,5)
(6,364 real changes made)

. lab def race 1 "Other" 2 "White" 3 "Black/African American" 4 "Hispanic/Latino" 5 "Asian" 

. lab value race race

. 
. gen gender = 1

. replace gender = 1 if perceived_gender=="Male"
(0 real changes made)

. replace gender = 2 if perceived_gender=="Female"
(17,700 real changes made)

. replace gender = 0 if perceived_gender=="Other"
(0 real changes made)

. lab def gender 1 "Male" 2 "Female" 0 "Other"

. lab value gender gender

. 
. 
. gen male = 1 if gender==1
(17,700 missing values generated)

. replace male = 0 if gender!=1
(17,700 real changes made)

. lab def male 1 "Male" 0 "Non-male"

. lab value male male

. 
. gen result_of_stoptype = 1 if result_of_stop=="Citation for infraction" | result_of_stop=="Citation"
(40,893 missing values generated)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction| Psychiatric hol(W&I Code 5150 or 5585.20)"
(0 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Contacted parent/legal guardian or other person responsible for the minor"
(3 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|In-field cite and release"
(5 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Warning (verbal or written)"
(16 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor"
(2 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Noncriminal transport or caretaking transport (in
> cluding transport by officer / ambulance or other agency)|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant"
(212 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(2 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or care
> taking transport (including transport by officer / ambulance or other agency)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Citation for infraction"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant"
(97 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.
> 20)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Warning (verbal or written)"
(2 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant"
(734 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(5 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Contacted parent/legal guardian or other person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant"
(43 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant|Contacted parent/legal guardian or other 
> person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Noncriminal transport or caretaking transport (including transport by officer / ambulance 
> or other agency)"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed"
(73 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed| Psychiatric hold (W&I Code 5150 or 5585.20)"
(3 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or
>  other agency)"
(5 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or
>  other agency)|Contacted parent/legal guardian or other person responsible for the minor| Psychiatric hold (W&I Code 5150 or 5585.20)"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(0 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Warning (verbal or written)"
(5 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release" 
(275 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(4 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Citation for infraction" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest without warrant" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Field interview card completed" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or ot
> her agency)" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or oth
> er agency)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(1 real change made)

. replace result_of_stoptype = 7 if result_of_stop== "No action" 
(1,324 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)" 
(69 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric ho
> ld (W&I Code 5150 or 5585.20)" 
(22 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric ho
> ld (W&I Code 5150 or 5585.20)|In-field cite and release" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Citation for in
> fraction" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted paren
> t/legal guardian or other person responsible for the minor" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted paren
> t/legal guardian or other person responsible for the minor| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)" 
(372 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Citation for infraction" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|In-field cite and release" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or caretaking transport (including transport by officer 
> / ambulance or other agency)" 
(6 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Warning (verbal or written)" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)" | result_of_stop=="Warning"
(34,476 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(5 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction" 
(6 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Field interview card completed" 
(45 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Noncriminal transport or caretaking transport (including transport by officer / ambulance or 
> other agency)"
(3 real changes made)

. replace result_of_stoptype = 11 if !inlist(result_of_stoptype,1,2,3,4,5,6,7,8,9,10)
(3,033 real changes made)

. lab def result_of_stoptype 1 "Citation for Infraction" 2 "Contacted Guardians" 3 "Custodial Arrest With Warrant" 4 "Custodial Arrest Without Warrant" 5 "Field Interview Card"
>  6 "In-Field Cite and Release" 7 "No Action" 8 "Noncriminal Transport" 9 "Psychiatric Hold" 10 "Warning" 11 "Other"

. lab value result_of_stoptype result_of_stoptype

. 
. gen reason = 1 if reason_for_stop=="Traffic Violation" | reason_for_stop=="Traffic"
(12,550 missing values generated)

. replace reason = 3 if reason_for_stop=="Knowledge of outstanding arrest warrant/wanted person"
(203 real changes made)

. replace reason = 2 if reason_for_stop=="Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(5,739 real changes made)

. replace reason = 4 if reason_for_stop=="Consensual encounter resulting in search"
(45 real changes made)

. replace reason = 5 if reason_for_stop=="Investigation"| reason_for_stop=="Investigation to determine whether person was truant"
(5,051 real changes made)

. replace reason = 6 if reason_for_stop=="Prob./Parole"| reason_for_stop=="Parole/probation/PRCS/mandatory supervision"
(969 real changes made)

. replace reason = 7 if !inlist(reason,1,2,3,4,5,6)
(543 real changes made)

. lab def reason 1 "Traffic Violation" 2 "Reasonable Suspicion" 3 "Warrant" 4 "Consensual Search" 5 "Investigation" 6 "Probation/Parole" 7 "Other" 

. lab value reason reason

. 
. 
. // gen type = 1 if type_of_stop  == "Vehicle"
. // replace type = 2 if type_of_stop  == "Pedestrian"
. // replace type = 3 if type_of_stop  == "Bicycle"
. // lab def type 1 "Vehicle" 2 "Pedestrian" 3 "Bicycle"
. // lab value type type 
. 
. gen arrest = 1 if inlist(result_of_stoptype,3,4)
(60,598 missing values generated)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest without warrant"
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. // replace arrest if result_of_stop == 
. replace arrest = 0 if !inlist(arrest, 1)
(60,586 real changes made)

. lab def arrest 1 "Arrested" 0 "Not Arrested"

. lab value arrest arrest

. 
. 
. gen other = 1 if race == 1
(55,338 missing values generated)

. replace other = 0 if race !=1
(55,338 real changes made)

. lab def other 1 "Other " 0 "Not Other " 

. lab value other other

. 
. 
. gen white = 1 if race == 2
(39,773 missing values generated)

. replace white = 0 if race !=2
(39,773 real changes made)

. lab def white  1 "White" 0 "Not White"

. lab value white white

. 
. 
. gen black = 1 if race == 3
(41,208 missing values generated)

. replace black = 0 if race !=3
(41,208 real changes made)

. lab def black 1 "Black/African American" 0 "Not Black/African American" 

. lab value black black

. 
. 
. gen hispanic = 1 if race == 4
(53,546 missing values generated)

. replace hispanic = 0 if race !=4
(53,546 real changes made)

. lab def hispanic 1 "Hispanic" 0 "Not Hispanic" 

. lab value hispanic hispanic

. 
. 
. gen asian = 1 if race == 5
(56,943 missing values generated)

. replace asian = 0 if race !=5
(56,943 real changes made)

. lab def asian 1 "Asian " 0 "Not Asian " 

. lab value asian asian

. 
. 
. gen nonwhite = 1 if inlist(race,1,3,4,5) 
(21,929 missing values generated)

. replace nonwhite = 0 if inlist(race,2)
(21,929 real changes made)

. lab def nonwhite 0 "White" 1 "Nonwhite"

. lab value nonwhite nonwhite

. 
. gen poc = 1 if inlist(race,1,3,4) 
(26,688 missing values generated)

. replace poc = 0 if !inlist(poc,1)
(26,688 real changes made)

. lab def poc 0 "Not POC" 1 "POC"

. lab value poc poc

. 
. gen far = 1 if tract_distancefromcal  >= 2
(46,893 missing values generated)

. replace far = 0 if tract_distancefromcal  < 2
(46,893 real changes made)

. lab def far 1 "Far from university" 0 "Not far from university" 

. lab value far far

. 
. gen close = 1 if tract_distancefromcal  <= 1.5
(29,381 missing values generated)

. replace close = 0 if tract_distancefromcal  > 1.5
(29,381 real changes made)

. lab def close 1 "Close to university" 0 "Not close to university" 

. lab value close close

. 
. gen reasonablesuspicion = 1 if reason_for_stop == "Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(55,963 missing values generated)

. replace reasonablesuspicion = 0 if !inlist(reasonablesuspicion, 1)
(55,963 real changes made)

. lab def reasonablesuspicion 1 "Stop based on reasonable suspicion" 0 "Stop based on other reason" 

. lab value reasonablesuspicion reasonablesuspicion

. 
. replace trafficstop = 1 if reason == 1 | type_of_stop == "Vehicle"
variable trafficstop not found
r(111);

end of do-file

r(111);

. do "C:\Users\KC1558~1\AppData\Local\Temp\27\STD1ac_000000.tmp"

. 
. gen trafficstop = 1 if reason == 1 | type_of_stop == "Vehicle"
(12,091 missing values generated)

. replace trafficstop = 0 if !inlist(trafficstop,1)
(12,091 real changes made)

. lab def trafficstop 1 "Traffic Stop" 0 "Pedestrian or Bicycle stop" 

. lab value trafficstop trafficstop

. 
. gen noactions = 1 if result_of_stoptype == 7 | result_of_stoptype == 10
(25,837 missing values generated)

. replace noactions = 0 if !inlist(noaction,1)
(25,837 real changes made)

. lab def noactions 1 "Released with no citation or arrest" 0 "Other" 

. lab value noactions noactions

. 
. gen warning = 1 if result_of_stoptype == 10 
(27,161 missing values generated)

. replace warning = 0 if !inlist(warning,1)
(27,161 real changes made)

. lab def warning 1 "Let off with Warning" 0 "Other"

. lab value warning warning

. 
end of do-file

. tab trafficstop

               trafficstop |      Freq.     Percent        Cum.
---------------------------+-----------------------------------
Pedestrian or Bicycle stop |     12,091       19.60       19.60
              Traffic Stop |     49,611       80.40      100.00
---------------------------+-----------------------------------
                     Total |     61,702      100.00

. tab reason_for_stop

                        reason_for_stop |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
                                      0 |        334        0.54        0.54
Consensual encounter resulting in sea.. |         45        0.07        0.61
                          Investigation |      5,018        8.13        8.75
Investigation to determine whether pe.. |         33        0.05        8.80
Knowledge of outstanding arrest warra.. |        203        0.33        9.13
Parole/probation/PRCS/mandatory super.. |         50        0.08        9.21
                           Prob./Parole |        919        1.49       10.70
                            Reas. Susp. |      2,216        3.59       14.29
                   Reasonable suspicion |      3,523        5.71       20.00
                                Traffic |     44,916       72.80       92.80
                      Traffic Violation |      4,236        6.87       99.67
                                 Wanted |        205        0.33      100.00
----------------------------------------+-----------------------------------
                                  Total |     61,698      100.00

