--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Log\Log BPDSTOPS - 3 May 2022.log
  log type:  text
 opened on:   3 May 2022, 15:47:30

. use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta"

. sysdir set PLUS "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110"

. // ssc install mcp2
. 
. 
. 
. 
. 
. gen race = 2 if perceived_race_or_ethnicity=="White"  
(39,773 missing values generated)

. replace race = 3 if perceived_race_or_ethnicity=="Black/African American" |  perceived_race_or_ethnicity=="Black"
(20,494 real changes made)

. replace race = 4 if perceived_race_or_ethnicity=="Hispanic/Latino" |  perceived_race_or_ethnicity=="Hispanic"
(8,156 real changes made)

. replace race = 5 if perceived_race_or_ethnicity=="Asian"   
(4,759 real changes made)

. replace race = 1 if !inlist(race,1,2,3,4,5)
(6,364 real changes made)

. lab def race 1 "Other" 2 "White" 3 "Black/African American" 4 "Hispanic/Latino" 5 "Asian" 

. lab value race race

. 
. gen gender = 1

. replace gender = 1 if perceived_gender=="Male"
(0 real changes made)

. replace gender = 2 if perceived_gender=="Female"
(17,700 real changes made)

. replace gender = 0 if perceived_gender=="Other"
(0 real changes made)

. lab def gender 1 "Male" 2 "Female" 0 "Other"

. lab value gender gender

. 
. 
. gen male = 1 if gender==1
(17,700 missing values generated)

. replace male = 0 if gender!=1
(17,700 real changes made)

. lab def male 1 "Male" 0 "Non-male"

. lab value male male

. 
. gen result_of_stoptype = 1 if result_of_stop=="Citation for infraction" | result_of_stop=="Citation"
(40,893 missing values generated)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction| Psychiatric hol(W&I Code 5150 or 5585.20)"
(0 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Contacted parent/legal guardian or other person responsible for the minor"
(3 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|In-field cite and release"
(5 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Warning (verbal or written)"
(16 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor"
(2 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Noncriminal transport or caretaking transport (in
> cluding transport by officer / ambulance or other agency)|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant"
(212 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(2 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or care
> taking transport (including transport by officer / ambulance or other agency)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Citation for infraction"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant"
(97 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.
> 20)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Warning (verbal or written)"
(2 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant"
(734 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(5 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Contacted parent/legal guardian or other person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant"
(43 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant|Contacted parent/legal guardian or other 
> person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Noncriminal transport or caretaking transport (including transport by officer / ambulance 
> or other agency)"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed"
(73 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed| Psychiatric hold (W&I Code 5150 or 5585.20)"
(3 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or
>  other agency)"
(5 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or
>  other agency)|Contacted parent/legal guardian or other person responsible for the minor| Psychiatric hold (W&I Code 5150 or 5585.20)"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(0 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Warning (verbal or written)"
(5 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release" 
(275 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(4 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Citation for infraction" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest without warrant" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Field interview card completed" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or ot
> her agency)" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or oth
> er agency)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(1 real change made)

. replace result_of_stoptype = 7 if result_of_stop== "No action" 
(1,324 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)" 
(69 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric ho
> ld (W&I Code 5150 or 5585.20)" 
(22 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric ho
> ld (W&I Code 5150 or 5585.20)|In-field cite and release" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Citation for in
> fraction" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted paren
> t/legal guardian or other person responsible for the minor" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted paren
> t/legal guardian or other person responsible for the minor| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)" 
(372 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Citation for infraction" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|In-field cite and release" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or caretaking transport (including transport by officer 
> / ambulance or other agency)" 
(6 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Warning (verbal or written)" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)" | result_of_stop=="Warning"
(34,476 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(5 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction" 
(6 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Field interview card completed" 
(45 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Noncriminal transport or caretaking transport (including transport by officer / ambulance or 
> other agency)"
(3 real changes made)

. replace result_of_stoptype = 11 if !inlist(result_of_stoptype,1,2,3,4,5,6,7,8,9,10)
(3,033 real changes made)

. lab def result_of_stoptype 1 "Citation for Infraction" 2 "Contacted Guardians" 3 "Custodial Arrest With Warrant" 4 "Custodial Arrest Without Warrant" 5 "Field Interview Card"
>  6 "In-Field Cite and Release" 7 "No Action" 8 "Noncriminal Transport" 9 "Psychiatric Hold" 10 "Warning" 11 "Other"

. lab value result_of_stoptype result_of_stoptype

. 
. gen reason = 1 if reason_for_stop=="Traffic Violation" | reason_for_stop=="Traffic"
(12,550 missing values generated)

. replace reason = 3 if reason_for_stop=="Knowledge of outstanding arrest warrant/wanted person"
(203 real changes made)

. replace reason = 2 if reason_for_stop=="Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(5,739 real changes made)

. replace reason = 4 if reason_for_stop=="Consensual encounter resulting in search"
(45 real changes made)

. replace reason = 5 if reason_for_stop=="Investigation"| reason_for_stop=="Investigation to determine whether person was truant"
(5,051 real changes made)

. replace reason = 6 if reason_for_stop=="Prob./Parole"| reason_for_stop=="Parole/probation/PRCS/mandatory supervision"
(969 real changes made)

. replace reason = 7 if !inlist(reason,1,2,3,4,5,6)
(543 real changes made)

. lab def reason 1 "Traffic Violation" 2 "Reasonable Suspicion" 3 "Warrant" 4 "Consensual Search" 5 "Investigation" 6 "Probation/Parole" 7 "Other" 

. lab value reason reason

. 
. 
. // gen type = 1 if type_of_stop  == "Vehicle"
. // replace type = 2 if type_of_stop  == "Pedestrian"
. // replace type = 3 if type_of_stop  == "Bicycle"
. // lab def type 1 "Vehicle" 2 "Pedestrian" 3 "Bicycle"
. // lab value type type 
. 
. gen arrest = 1 if inlist(result_of_stoptype,3,4)
(60,598 missing values generated)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest without warrant"
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. // replace arrest if result_of_stop == 
. replace arrest = 0 if !inlist(arrest, 1)
(60,586 real changes made)

. lab def arrest 1 "Arrested" 0 "Not Arrested"

. lab value arrest arrest

. 
. 
. gen other = 1 if race == 1
(55,338 missing values generated)

. replace other = 0 if race !=1
(55,338 real changes made)

. lab def other 1 "Other " 0 "Not Other " 

. lab value other other

. 
. 
. gen white = 1 if race == 2
(39,773 missing values generated)

. replace white = 0 if race !=2
(39,773 real changes made)

. lab def white  1 "White" 0 "Not White"

. lab value white white

. 
. 
. gen black = 1 if race == 3
(41,208 missing values generated)

. replace black = 0 if race !=3
(41,208 real changes made)

. lab def black 1 "Black/African American" 0 "Not Black/African American" 

. lab value black black

. 
. 
. gen hispanic = 1 if race == 4
(53,546 missing values generated)

. replace hispanic = 0 if race !=4
(53,546 real changes made)

. lab def hispanic 1 "Hispanic" 0 "Not Hispanic" 

. lab value hispanic hispanic

. 
. 
. gen asian = 1 if race == 5
(56,943 missing values generated)

. replace asian = 0 if race !=5
(56,943 real changes made)

. lab def asian 1 "Asian " 0 "Not Asian " 

. lab value asian asian

. 
. 
. gen nonwhite = 1 if inlist(race,1,3,4,5) 
(21,929 missing values generated)

. replace nonwhite = 0 if inlist(race,2)
(21,929 real changes made)

. lab def nonwhite 0 "White" 1 "Nonwhite"

. lab value nonwhite nonwhite

. 
. gen poc = 1 if inlist(race,1,3,4) 
(26,688 missing values generated)

. replace poc = 0 if !inlist(poc,1)
(26,688 real changes made)

. lab def poc 0 "Not POC" 1 "POC"

. lab value poc poc

. 
. gen far = 1 if tract_distancefromcal  >= 2
(46,893 missing values generated)

. replace far = 0 if tract_distancefromcal  < 2
(46,893 real changes made)

. lab def far 1 "Far from university" 0 "Not far from university" 

. lab value far far

. 
. gen close = 1 if tract_distancefromcal  <= 1.5
(29,381 missing values generated)

. replace close = 0 if tract_distancefromcal  > 1.5
(29,381 real changes made)

. lab def close 1 "Close to university" 0 "Not close to university" 

. lab value close close

. 
. gen reasonablesuspicion = 1 if reason_for_stop == "Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(55,963 missing values generated)

. replace reasonablesuspicion = 0 if !inlist(reasonablesuspicion, 1)
(55,963 real changes made)

. lab def reasonablesuspicion 1 "Stop based on reasonable suspicion" 0 "Stop based on other reason" 

. lab value reasonablesuspicion reasonablesuspicion

. 
. gen trafficstop = 1 if reason == 1 | type_of_stop == "Vehicle"
(12,091 missing values generated)

. replace trafficstop = 0 if !inlist(trafficstop,1)
(12,091 real changes made)

. lab def trafficstop 1 "Traffic Stop" 0 "Not Traffic Stop" 

. lab value trafficstop trafficstop

. 
. gen noactions = 1 if result_of_stoptype == 7 | result_of_stoptype == 10
(25,837 missing values generated)

. replace noactions = 0 if !inlist(noaction,1)
(25,837 real changes made)

. lab def noactions 1 "Released with no citation or arrest" 0 "Other" 

. lab value noactions noactions

. 
. gen warning = 1 if result_of_stoptype == 10 
(27,161 missing values generated)

. replace warning = 0 if !inlist(warning,1)
(27,161 real changes made)

. lab def warning 1 "Let off with Warning" 0 "Other"

. lab value warning warning

. 
. // replace perceived_gender = 2 if !inlist(perceived_gender,0,1)
. 
. 
. sum arrest reason result_of_stoptype arrest perceived_age nonwhite poc race trafficstop noactions warning tract_totalnumstops tract_annualstops tract_medianincome tract_pocpo
> p

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      arrest |     61,702    .0180869     .133267          0          1
      reason |     61,702    1.560549    1.348241          1          7
result_of_~e |     61,702     6.79764    4.263199          1         11
      arrest |     61,702    .0180869     .133267          0          1
perceived_~e |     61,702    36.41759    11.97455          0         99
-------------+---------------------------------------------------------
    nonwhite |     61,702    .6445982    .4786388          0          1
         poc |     61,702    .5674694     .495431          0          1
        race |     61,702    2.724758    1.064389          1          5
 trafficstop |     61,702     .804042    .3969396          0          1
   noactions |     61,702    .5812615    .4933564          0          1
-------------+---------------------------------------------------------
     warning |     61,702    .5598036    .4964147          0          1
tract_tota~s |     61,702    4307.167    3673.784         87      11450
tract_annu~s |     61,702    538.4017    459.0856         11       1431
tract_medi~e |     60,897    88052.36    34370.36      20579     206199
tract_pocpop |     60,897    672.1871    418.4064        106       1693

. 
. 
. 
. 
. // https://www.stata.com/manuals/spintro4.pdf#spIntro4
. // ssc install shp2dta, replace
. // ssc install spshape2dta, replace
. //
. // unzipfile Census_Tract_Polygons_2010.zip
. //
. // spshape2dta geo_export_c67dd96f-bd48-4ef9-88a6-0902237d752f
. //
. // use geo_export_c67dd96f-bd48-4ef9-88a6-0902237d752f, clear
. // describe
. // list in 1/5
. 
. 
. // generate long fips = real(ID)
. // // bysort fips: assert _N==1
. // assert fips != .
. 
. 
. // gen pop = totalpop  //population for each tract
. 
. // ssc install spmap, replace
. 
. spmap tract_totalnumstops using geo_export_c67dd96f-bd48-4ef9-88a6-0902237d752f_shp, id(ID) fcolor(Blues)  
variable ID not found
(error in option id())
r(111);

end of do-file

r(111);

. do "C:\Users\KC1558~1\AppData\Local\Temp\2\STD1b30_000000.tmp"

. // model code based on lab 8
. // use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops.dta"
. 
. 
. 
. // factor race distancefromcalsimple durationofstop, pcf
. // rotate
. // predict arrest
. // label var arrest "Arrest Factor Scores"
. // alpha race distancefromcalsimple durationofstop, item
. 
. 
. 
. local study "arrest"

. local model "arrest"

. 
. logit arrest white perceived_age gender, or   //Model 1

Iteration 0:   log likelihood = -5583.8692  
Iteration 1:   log likelihood = -5528.0388  
Iteration 2:   log likelihood = -5526.1733  
Iteration 3:   log likelihood = -5526.1709  
Iteration 4:   log likelihood = -5526.1709  

Logistic regression                             Number of obs     =     61,702
                                                LR chi2(3)        =     115.40
                                                Prob > chi2       =     0.0000
Log likelihood = -5526.1709                     Pseudo R2         =     0.0103

-------------------------------------------------------------------------------
       arrest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        white |   .9658809   .0622906    -0.54   0.590     .8511943     1.09602
perceived_age |   1.009199   .0025735     3.59   0.000     1.004168    1.014255
       gender |   .4651089   .0384378    -9.26   0.000     .3955571    .5468903
        _cons |   .0337741   .0046748   -24.48   0.000     .0257493    .0442997
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) s
> ymbol(***, **, *) replace
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results arrest-.xls
dir : seeout

. logit arrest white perceived_age gender trafficstop, or   //Model 2

Iteration 0:   log likelihood = -5583.8692  
Iteration 1:   log likelihood = -4858.6415  
Iteration 2:   log likelihood = -4713.9151  
Iteration 3:   log likelihood = -4713.0107  
Iteration 4:   log likelihood = -4713.0097  
Iteration 5:   log likelihood = -4713.0097  

Logistic regression                             Number of obs     =     61,702
                                                LR chi2(4)        =    1741.72
                                                Prob > chi2       =     0.0000
Log likelihood = -4713.0097                     Pseudo R2         =     0.1560

-------------------------------------------------------------------------------
       arrest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
--------------+----------------------------------------------------------------
        white |   .8200497   .0535953    -3.04   0.002     .7214545    .9321192
perceived_age |   1.007974    .002439     3.28   0.001     1.003205    1.012766
       gender |   .6781022   .0571275    -4.61   0.000       .57489    .7998445
  trafficstop |   .0740958   .0052998   -36.38   0.000     .0644036    .0852464
        _cons |    .095196   .0131868   -16.98   0.000     .0725618    .1248905
-------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) s
> ymbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results arrest-.xls
dir : seeout

. logit arrest white perceived_age gender trafficstop tract_distancefromcal tract_totalpop tract_medianincome tract_annualstops tract_nonwhitecomp, or   //Model 3

Iteration 0:   log likelihood = -5525.2326  
Iteration 1:   log likelihood = -4777.0569  
Iteration 2:   log likelihood = -4616.8504  
Iteration 3:   log likelihood = -4615.5784  
Iteration 4:   log likelihood =  -4615.576  
Iteration 5:   log likelihood =  -4615.576  

Logistic regression                             Number of obs     =     60,897
                                                LR chi2(9)        =    1819.31
                                                Prob > chi2       =     0.0000
Log likelihood =  -4615.576                     Pseudo R2         =     0.1646

---------------------------------------------------------------------------------------
               arrest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------------+----------------------------------------------------------------
                white |   .8200504   .0548353    -2.97   0.003     .7193202    .9348863
        perceived_age |   1.007991   .0024528     3.27   0.001     1.003195     1.01281
               gender |   .6743429   .0571746    -4.65   0.000     .5710986     .796252
          trafficstop |   .0670231   .0049421   -36.65   0.000     .0580042    .0774443
tract_distancefromcal |   1.167869   .0963384     1.88   0.060     .9935232     1.37281
       tract_totalpop |   1.000106   .0000334     3.17   0.001     1.000041    1.000172
   tract_medianincome |   1.000008   1.81e-06     4.32   0.000     1.000004    1.000011
    tract_annualstops |   .9993047   .0000926    -7.51   0.000     .9991232    .9994862
   tract_nonwhitecomp |   1.706769   .4813299     1.90   0.058     .9820315    2.966362
                _cons |   .0326773   .0122192    -9.15   0.000     .0157019    .0680051
---------------------------------------------------------------------------------------
Note: _cons estimates baseline odds.

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) s
> ymbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results arrest-.xls
dir : seeout

.         
. 
. 
. 
. // local study "arrest"
. // local model "arrest"
. //
. // logit arrest black perceivedage gender, or   //Model 1
. //      outreg2 using "\\Client\C$\Users\timet\Desktop\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) sym
> bol(***, **, *) replace
. // logit arrest black perceivedage gender reason, or   //Model 2
. //      outreg2 using "\\Client\C$\Users\timet\Desktops\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) sy
> mbol(***, **, *) append
. // logit arrest black perceivedage gender reason distancefromcal area_totalpop area_medianincome area_annualstops nonwhitecomp, or   //Model 3
. //      outreg2 using "\\Client\C$\Users\timet\Desktop\GitHub\Berkeley-PD-ISF-110\Exports\rough_final_Results `study'-`c_date'.xls", eform dec(3) alpha(0.001, 0.01, 0.05) sym
> bol(***, **, *) append
. 
. 
. 
. 
. 
. 
. 
. 
. //
. //
. // factor race wowater womedi wofuel woincome, pcf
. // rotate
. // predict arrpi
. // label var arrpi "Arrest Factor Scores"
. // alpha wofood wowater womedi wofuel woincome, item
. //
. //
. //
. // local study "arrpi"
. //
. // reg lpi egrid pwater sewage road   //Model 1
. //      outreg2 using "\\Client\C$\ISF_110\Lab 8\Results\Results `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) replace
. // reg lpi egrid pwater sewage road ps army   //Model 2
. //      outreg2 using "\\Client\C$\ISF_110\Lab 8\Results\Results `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
. // reg lpi egrid pwater sewage road ps army rule_law control_cor demo_sat goveff_p qual_bur   //Model 3
. //      outreg2 using "\\Client\C$\ISF_110\Lab 8\Results\Results `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
. // reg lpi egrid pwater sewage road ps army rule_law control_cor demo_sat goveff_p qual_bur urban east_africa_only southern_africa_only north_africa_only   //Model 4
. //      outreg2 using "\\Client\C$\ISF_110\Lab 8\Results\Results `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
. // /
. //      
. // local study "lli"
. 
end of do-file

