------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Log\Log BPDSTOPS -21 Apr 2022.log
  log type:  text
 opened on:  21 Apr 2022, 17:08:18

. use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta"

. sysdir set PLUS "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110"

. // ssc install mcp2
. 
. 
. 
. 
. 
. gen race = 2 if perceived_race_or_ethnicity=="White"  
(39,773 missing values generated)

. replace race = 3 if perceived_race_or_ethnicity=="Black/African American" |  perceived_race_or_ethnicity=="Black"
(20,494 real changes made)

. replace race = 4 if perceived_race_or_ethnicity=="Hispanic/Latino" |  perceived_race_or_ethnicity=="Hispanic"
(8,156 real changes made)

. replace race = 5 if perceived_race_or_ethnicity=="Asian"   
(4,759 real changes made)

. replace race = 1 if !inlist(race,1,2,3,4,5)
(6,364 real changes made)

. lab def race 1 "Other" 2 "White" 3 "Black/African American" 4 "Hispanic/Latino" 5 "Asian" 

. lab value race race

. 
. gen gender = 1

. replace gender = 1 if perceived_gender=="Male"
(0 real changes made)

. replace gender = 2 if perceived_gender=="Female"
(17,700 real changes made)

. replace gender = 0 if perceived_gender=="Other"
(0 real changes made)

. lab def gender 1 "Male" 2 "Female" 0 "Other"

. lab value gender gender

. 
. 
. gen male = 1 if gender==1
(17,700 missing values generated)

. replace male = 0 if gender!=1
(17,700 real changes made)

. lab def male 1 "Male" 0 "Non-male"

. lab value male male

. 
. gen result_of_stoptype = 1 if result_of_stop=="Citation for infraction" | result_of_stop=="Citation"
(40,893 missing values generated)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction| Psychiatric hol(W&I Code 5150 or 5585.20)"
(0 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Contacted parent/legal guardian or other person responsible for the minor"
(3 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|In-field cite and release"
(5 real changes made)

. replace result_of_stoptype = 1 if result_of_stop=="Citation for infraction|Warning (verbal or written)"
(16 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor"
(2 real changes made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Noncriminal transport or caretaking transport (including transport by officer / ambulance or ot
> her agency)|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 2 if result_of_stop=="Contacted parent/legal guardian or other person responsible for the minor|Warning (verbal or written)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant"
(212 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(2 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant| Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or caretaking transport (including transport by offic
> er / ambulance or other agency)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Citation for infraction"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant"
(97 real changes made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 3 if result_of_stop=="Custodial arrest pursuant to outstanding warrant|Warning (verbal or written)"
(2 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant"
(734 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant| Psychiatric hold (W&I Code 5150 or 5585.20)"
(5 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Contacted parent/legal guardian or other person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant"
(43 real changes made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Custodial arrest pursuant to outstanding warrant|Contacted parent/legal guardian or other person responsible for the minor"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)"
(1 real change made)

. replace result_of_stoptype = 4 if result_of_stop=="Custodial arrest without warrant|Field interview card completed"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed"
(73 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed| Psychiatric hold (W&I Code 5150 or 5585.20)"
(3 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)"
(5 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted parent/legal guardian
>  or other person responsible for the minor| Psychiatric hold (W&I Code 5150 or 5585.20)"
(1 real change made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|In-field cite and release"
(0 real changes made)

. replace result_of_stoptype = 5 if result_of_stop=="Field interview card completed|Warning (verbal or written)"
(5 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release" 
(275 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(4 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Citation for infraction" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Custodial arrest without warrant" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Field interview card completed" 
(3 real changes made)

. replace result_of_stoptype = 6 if result_of_stop==  "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)" 
(2 real changes made)

. replace result_of_stoptype = 6 if result_of_stop== "In-field cite and release|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric hold (W&I Code 5150 or
>  5585.20)" 
(1 real change made)

. replace result_of_stoptype = 7 if result_of_stop== "No action" 
(1,324 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)" 
(69 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(22 real changes made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)| Psychiatric hold (W&I Code 5150 or 5585.20)|In-field cite an
> d release" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Citation for infraction" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted parent/legal guardian or other person responsible f
> or the minor" 
(1 real change made)

. replace result_of_stoptype = 8 if result_of_stop== "Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)|Contacted parent/legal guardian or other person responsible f
> or the minor| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)" 
(372 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Citation for infraction" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|In-field cite and release" 
(2 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)" 
(6 real changes made)

. replace result_of_stoptype = 9 if result_of_stop== "Psychiatric hold (W&I Code 5150 or 5585.20)|Warning (verbal or written)" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)" | result_of_stop=="Warning"
(34,476 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)| Psychiatric hold (W&I Code 5150 or 5585.20)" 
(5 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction" 
(6 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Citation for infraction|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Field interview card completed" 
(45 real changes made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|In-field cite and release|Field interview card completed" 
(1 real change made)

. replace result_of_stoptype = 10 if result_of_stop== "Warning (verbal or written)|Noncriminal transport or caretaking transport (including transport by officer / ambulance or other agency)"
(3 real changes made)

. replace result_of_stoptype = 11 if !inlist(result_of_stoptype,1,2,3,4,5,6,7,8,9,10)
(3,033 real changes made)

. lab def result_of_stoptype 1 "Citation for Infraction" 2 "Contacted Guardians" 3 "Custodial Arrest With Warrant" 4 "Custodial Arrest Without Warrant" 5 "Field Interview Card" 6 "In-Field Cite and Release" 7 "No Action" 8
>  "Noncriminal Transport" 9 "Psychiatric Hold" 10 "Warning" 11 "Other"

. lab value result_of_stoptype result_of_stoptype

. 
. gen reason = 1 if reason_for_stop=="Traffic Violation" | reason_for_stop=="Traffic"
(12,550 missing values generated)

. replace reason = 3 if reason_for_stop=="Knowledge of outstanding arrest warrant/wanted person"
(203 real changes made)

. replace reason = 2 if reason_for_stop=="Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(5,739 real changes made)

. replace reason = 4 if reason_for_stop=="Consensual encounter resulting in search"
(45 real changes made)

. replace reason = 5 if reason_for_stop=="Investigation"| reason_for_stop=="Investigation to determine whether person was truant"
(5,051 real changes made)

. replace reason = 6 if reason_for_stop=="Prob./Parole"| reason_for_stop=="Parole/probation/PRCS/mandatory supervision"
(969 real changes made)

. replace reason = 7 if !inlist(reason,1,2,3,4,5,6)
(543 real changes made)

. lab def reason 1 "Traffic Violation" 2 "Reasonable Suspicion" 3 "Warrant" 4 "Consensual Search" 5 "Investigation" 6 "Probation/Parole" 7 "Other" 

. lab value reason reason

. 
. 
. gen type = 1 if type_of_stop  == "Bicycle"
(61,561 missing values generated)

. replace type = 2 if type_of_stop  == "Pedestrian"
(3,419 real changes made)

. replace type = 3 if type_of_stop  == "Vehicle"
(4,530 real changes made)

. lab def type 1 "Vehicle" 2 "Pedestrian" 3 "Vehicle"

. lab value type type 

. 
. gen arrest = 1 if inlist(result_of_stoptype,3,4)
(60,598 missing values generated)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest without warrant" 
(1 real change made)

. replace arrest = 1 if result_of_stop == "Warning (verbal or written)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest without warrant" 
(4 real changes made)

. replace arrest = 1 if result_of_stop == "Psychiatric hold (W&I Code 5150 or 5585.20)|Custodial arrest pursuant to outstanding warrant" 
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest without warrant"
(2 real changes made)

. replace arrest = 1 if result_of_stop == "In-field cite and release|Custodial arrest pursuant to outstanding warrant" 
(1 real change made)

. // replace arrest if result_of_stop == 
. replace arrest = 0 if !inlist(arrest, 1)
(60,586 real changes made)

. lab def arrest 1 "Arrested" 0 "Not Arrested"

. lab value arrest arrest

. 
. 
. gen other = 1 if race == 1
(55,338 missing values generated)

. replace other = 0 if race !=1
(55,338 real changes made)

. lab def other 1 "Other " 0 "Not Other " 

. lab value other other

. 
. 
. gen white = 1 if race == 2
(39,773 missing values generated)

. replace white = 0 if race !=2
(39,773 real changes made)

. lab def white  1 "White" 0 "Not White"

. lab value white white

. 
. 
. gen black = 1 if race == 3
(41,208 missing values generated)

. replace black = 0 if race !=3
(41,208 real changes made)

. lab def black 1 "Black/African American" 0 "Not Black/African American" 

. lab value black black

. 
. 
. gen hispanic = 1 if race == 4
(53,546 missing values generated)

. replace hispanic = 0 if race !=4
(53,546 real changes made)

. lab def hispanic 1 "Hispanic" 0 "Not Hispanic" 

. lab value hispanic hispanic

. 
. 
. gen asian = 1 if race == 5
(56,943 missing values generated)

. replace asian = 0 if race !=5
(56,943 real changes made)

. lab def asian 1 "Asian " 0 "Not Asian " 

. lab value asian asian

. 
. 
. gen nonwhite = 1 if inlist(race,1,3,4,5) 
(21,929 missing values generated)

. replace nonwhite = 0 if inlist(race,2)
(21,929 real changes made)

. lab def nonwhite 0 "White" 1 "Nonwhite"

. lab value nonwhite nonwhite

. 
. gen poc = 1 if inlist(race,1,3,4) 
(26,688 missing values generated)

. replace poc = 0 if !inlist(poc,1)
(26,688 real changes made)

. lab def poc 0 "Not POC" 1 "POC"

. lab value poc poc

. 
. gen far = 1 if tract_distancefromcal  >= 2
(46,893 missing values generated)

. replace far = 0 if tract_distancefromcal  < 2
(46,893 real changes made)

. lab def far 1 "Far from university" 0 "Not far from university" 

. lab value far far

. 
. gen close = 1 if tract_distancefromcal  <= 1.5
(29,381 missing values generated)

. replace close = 0 if tract_distancefromcal  > 1.5
(29,381 real changes made)

. lab def close 1 "Close to university" 0 "Not close to university" 

. lab value close close

. 
. gen reasonablesuspicion = 1 if reason_for_stop == "Reasonable suspicion" | reason_for_stop=="Reas. Susp."
(55,963 missing values generated)

. replace reasonablesuspicion = 0 if !inlist(reasonablesuspicion, 1)
(55,963 real changes made)

. lab def reasonablesuspicion 1 "Stop based on reasonable suspicion" 0 "Stop based on other reason" 

. lab value reasonablesuspicion reasonablesuspicion

. 
. gen trafficstop = 1 if reason == 2 | type_of_stop == "Vehicle"
(51,847 missing values generated)

. replace trafficstop = 0 if !inlist(trafficstop,1)
(51,847 real changes made)

. lab def trafficstop 1 "Traffic Stop" 0 "Pedestrian or Bicycle stop" 

. lab value trafficstop trafficstop

. 
. gen noactions = 1 if result_of_stoptype == 7 | result_of_stoptype == 10
(25,837 missing values generated)

. replace noactions = 0 if !inlist(noaction,1)
(25,837 real changes made)

. lab def noactions 1 "Released with no citation or arrest" 0 "Other" 

. lab value noactions noactions

. 
. gen warning = 1 if result_of_stoptype == 10 
(27,161 missing values generated)

. replace warning = 0 if !inlist(warning,1)
(27,161 real changes made)

. lab def warning 1 "Let off with Warning" 0 "Other"

. lab value warning warning

. 
. // replace perceived_gender = 2 if !inlist(perceived_gender,0,1)
. 
. 
. sum arrest reason result_of_stoptype arrest perceivedage nonwhite poc race trafficstop noactions warning area_totalstops area_annualstops area_medianincome
variable perceivedage not found
r(111);

end of do-file

r(111);

. sum arrest reason result_of_stoptype arrest perceivedage nonwhite poc race trafficstop noactions warning area_totalstops area_annualstops area_medianincome
variable perceivedage not found
r(111);

. tab perceived_age

perceived_a |
         ge |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        334        0.54        0.54
         10 |          5        0.01        0.55
         11 |          4        0.01        0.56
         12 |          1        0.00        0.56
         13 |          1        0.00        0.56
         14 |          1        0.00        0.56
         15 |      1,350        2.19        2.75
         16 |         16        0.03        2.77
         17 |         27        0.04        2.82
         18 |         90        0.15        2.96
         19 |         57        0.09        3.06
         20 |        537        0.87        3.93
         21 |        120        0.19        4.12
         22 |        104        0.17        4.29
         23 |         80        0.13        4.42
         24 |     17,579       28.49       32.91
         25 |        785        1.27       34.18
         26 |         56        0.09       34.27
         27 |         41        0.07       34.34
         28 |         93        0.15       34.49
         29 |         12        0.02       34.51
         30 |      1,421        2.30       36.81
         31 |          9        0.01       36.83
         32 |         32        0.05       36.88
         33 |         16        0.03       36.90
         34 |         21        0.03       36.94
         35 |     15,201       24.64       61.57
         36 |         25        0.04       61.62
         37 |         18        0.03       61.64
         38 |         34        0.06       61.70
         39 |         11        0.02       61.72
         40 |      1,128        1.83       63.55
         41 |          6        0.01       63.56
         42 |          9        0.01       63.57
         43 |          7        0.01       63.58
         44 |          9        0.01       63.60
         45 |        519        0.84       64.44
         46 |          7        0.01       64.45
         47 |          5        0.01       64.46
         48 |         11        0.02       64.47
         49 |          8        0.01       64.49
          5 |          2        0.00       64.49
         50 |     20,870       33.82       98.31
         51 |          4        0.01       98.32
         52 |          4        0.01       98.33
         53 |          2        0.00       98.33
         54 |          5        0.01       98.34
         55 |        255        0.41       98.75
         56 |          9        0.01       98.77
         57 |          4        0.01       98.77
         58 |          3        0.00       98.78
         59 |          4        0.01       98.78
         60 |        454        0.74       99.52
         61 |          1        0.00       99.52
         62 |          2        0.00       99.53
         64 |          2        0.00       99.53
         65 |        125        0.20       99.73
         66 |          4        0.01       99.74
         67 |          5        0.01       99.75
         68 |          3        0.00       99.75
         69 |          3        0.00       99.76
         70 |        107        0.17       99.93
         72 |          1        0.00       99.93
         73 |          2        0.00       99.93
         75 |         17        0.03       99.96
         77 |          1        0.00       99.96
         78 |          1        0.00       99.96
         79 |          1        0.00       99.97
         80 |         11        0.02       99.98
         82 |          1        0.00       99.99
         83 |          1        0.00       99.99
         85 |          4        0.01       99.99
          9 |          1        0.00      100.00
         90 |          2        0.00      100.00
         99 |          1        0.00      100.00
------------+-----------------------------------
      Total |     61,702      100.00

. sum arrest reason result_of_stoptype arrest perceive_dage nonwhite poc race trafficstop noactions warning area_totalstops area_annualstops area_medianincome
variable perceive_dage not found
r(111);

. sum arrest reason result_of_stoptype arrest perceived_age nonwhite poc race trafficstop noactions warning area_totalstops area_annualstops area_medianincome
variable area_totalstops not found
r(111);

. sum arrest reason result_of_stoptype arrest perceived_age nonwhite poc race trafficstop noactions warning tract_totalstops tract_annualstops tract_medianincome tractpocpop
variable tract_totalstops not found
r(111);

. sum arrest reason result_of_stoptype arrest perceived_age nonwhite poc race trafficstop noactions warning tract_totalnumstops tract_annualstops tract_medianincome tractpocpop
variable tractpocpop not found
r(111);

. sum arrest reason result_of_stoptype arrest perceived_age nonwhite poc race trafficstop noactions warning tract_totalnumstops tract_annualstops tract_medianincome tract_pocpop

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      arrest |     61,702    .0180869     .133267          0          1
      reason |     61,702    1.560549    1.348241          1          7
result_of_~e |     61,702     6.79764    4.263199          1         11
      arrest |     61,702    .0180869     .133267          0          1
perceived_~e |          0
-------------+---------------------------------------------------------
    nonwhite |     61,702    .6445982    .4786388          0          1
         poc |     61,702    .5674694     .495431          0          1
        race |     61,702    2.724758    1.064389          1          5
 trafficstop |     61,702    .1597193    .3663485          0          1
   noactions |     61,702    .5812615    .4933564          0          1
-------------+---------------------------------------------------------
     warning |     61,702    .5598036    .4964147          0          1
tract_tota~s |     61,702    4307.167    3673.784         87      11450
tract_annu~s |     61,702    538.4017    459.0856         11       1431
tract_medi~e |     60,897    88052.36    34370.36      20579     206199
tract_pocpop |     60,897    672.1871    418.4064        106       1693

