------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Log\Multilinear_Log BPDSTOPS -21 Apr 2022.log
  log type:  text
 opened on:  21 Apr 2022, 13:50:46

. use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\census_info_multilinear.dta"

. // sysdir set PLUS "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110"
. 
. 
. 
. 
. 
. 
. reg totalnumstops totalpop medianincome distancefromcal   //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(3, 28)        =      3.00
       Model |  36301835.1         3  12100611.7   Prob > F        =    0.0473
    Residual |   112922064        28  4032930.85   R-squared       =    0.2433
-------------+----------------------------------   Adj R-squared   =    0.1622
       Total |   149223899        31  4813674.16   Root MSE        =    2008.2

---------------------------------------------------------------------------------
  totalnumstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |   -.159417   .3749531    -0.43   0.674    -.9274736    .6086396
   medianincome |  -.0224015   .0090106    -2.49   0.019    -.0408589    -.003944
distancefromcal |    1489.03   804.7614     1.85   0.075    -159.4486    3137.509
          _cons |   2863.784   2490.178     1.15   0.260    -2237.114    7964.682
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) replace
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults BPDSTOPS-21 Apr 2022.xls
dir : seeout

. reg totalnumstops totalpop medianincome distancefromcal poccomp  //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(4, 27)        =      2.58
       Model |  41220946.7         4  10305236.7   Prob > F        =    0.0602
    Residual |   108002952        27  4000109.34   R-squared       =    0.2762
-------------+----------------------------------   Adj R-squared   =    0.1690
       Total |   149223899        31  4813674.16   Root MSE        =      2000

---------------------------------------------------------------------------------
  totalnumstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |  -.2057175   .3757511    -0.55   0.589    -.9766951    .5652601
   medianincome |  -.0291851   .0108606    -2.69   0.012    -.0514691   -.0069011
distancefromcal |   2111.889   978.6955     2.16   0.040      103.772    4120.007
        poccomp |  -4499.267   4057.274    -1.11   0.277     -12824.1    3825.572
          _cons |   3757.407    2607.66     1.44   0.161     -1593.07    9107.884
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults BPDSTOPS-21 Apr 2022.xls
dir : seeout

. reg totalnumstops totalpop medianincome distancefromcal poccomp annualstops //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(5, 26)        >  99999.00
       Model |   149223813         5  29844762.6   Prob > F        =    0.0000
    Residual |  86.1526092        26  3.31356189   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |   149223899        31  4813674.16   Root MSE        =    1.8203

---------------------------------------------------------------------------------
  totalnumstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |   .0000611   .0003439     0.18   0.860    -.0006458    .0007679
   medianincome |   1.08e-06   .0000111     0.10   0.924    -.0000218    .0000239
distancefromcal |    .785182   .9644598     0.81   0.423    -1.197294    2.767658
        poccomp |  -3.564431   3.775744    -0.94   0.354    -11.32558    4.196722
    annualstops |   8.001521   .0014015  5709.13   0.000      7.99864    8.004402
          _cons |   -1.52342   2.462988    -0.62   0.542    -6.586165    3.539325
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults BPDSTOPS-21 Apr 2022.xls
dir : seeout

. 
end of do-file

. br

. tab distancefromcal

distancefro |
       mcal |      Freq.     Percent        Cum.
------------+-----------------------------------
        .25 |          1        3.03        3.03
        .36 |          1        3.03        6.06
        .39 |          1        3.03        9.09
        .56 |          1        3.03       12.12
         .6 |          1        3.03       15.15
        .65 |          2        6.06       21.21
        .84 |          1        3.03       24.24
        .87 |          1        3.03       27.27
         .9 |          1        3.03       30.30
        .94 |          1        3.03       33.33
       1.01 |          1        3.03       36.36
       1.07 |          1        3.03       39.39
       1.08 |          1        3.03       42.42
       1.19 |          1        3.03       45.45
       1.22 |          1        3.03       48.48
       1.32 |          1        3.03       51.52
       1.33 |          1        3.03       54.55
       1.39 |          1        3.03       57.58
       1.42 |          1        3.03       60.61
       1.44 |          1        3.03       63.64
       1.58 |          1        3.03       66.67
        1.6 |          1        3.03       69.70
       1.73 |          2        6.06       75.76
       1.78 |          1        3.03       78.79
       1.82 |          1        3.03       81.82
       1.94 |          2        6.06       87.88
       1.99 |          2        6.06       93.94
       2.08 |          1        3.03       96.97
        2.5 |          1        3.03      100.00
------------+-----------------------------------
      Total |         33      100.00

. max distancefromcal
command max is unrecognized
r(199);

. sum distancefromcal

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
distancefr~l |         33    1.277576    .5720688        .25        2.5

. do "C:\Users\KC1558~1\AppData\Local\Temp\19\STD1f18_000000.tmp"

. reg annualstops totalpop medianincome distancefromcal   //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(3, 28)        =      3.00
       Model |  567134.499         3  189044.833   Prob > F        =    0.0472
    Residual |  1763613.38        28   62986.192   R-squared       =    0.2433
-------------+----------------------------------   Adj R-squared   =    0.1623
       Total |  2330747.88        31  75185.4153   Root MSE        =    250.97

---------------------------------------------------------------------------------
    annualstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |  -.0199356   .0468586    -0.43   0.674     -.115921    .0760499
   medianincome |  -.0028005   .0011261    -2.49   0.019    -.0051071   -.0004938
distancefromcal |   186.0569   100.5725     1.85   0.075    -19.95657    392.0705
          _cons |   358.1838   311.2022     1.15   0.259     -279.285    995.6526
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) replace
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults -.xls
dir : seeout

. reg annualstops totalpop medianincome distancefromcal poccomp  //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(4, 27)        =      2.58
       Model |  643844.708         4  160961.177   Prob > F        =    0.0602
    Residual |  1686903.17        27  62477.8951   R-squared       =    0.2762
-------------+----------------------------------   Adj R-squared   =    0.1690
       Total |  2330747.88        31  75185.4153   Root MSE        =    249.96

---------------------------------------------------------------------------------
    annualstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |  -.0257174   .0469599    -0.55   0.588    -.1220713    .0706364
   medianincome |  -.0036476   .0013573    -2.69   0.012    -.0064326   -.0008626
distancefromcal |   263.8378   122.3136     2.16   0.040       12.871    514.8047
        poccomp |  -561.8559   507.0626    -1.11   0.278    -1602.262    478.5506
          _cons |    469.777   325.8954     1.44   0.161    -198.9052    1138.459
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults -.xls
dir : seeout

. reg annualstops totalpop medianincome distancefromcal poccomp totalnumstops //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(5, 26)        >  99999.00
       Model |  2330746.53         5  466149.306   Prob > F        =    0.0000
    Residual |  1.34562164        26  .051754678   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |  2330747.88        31  75185.4153   Root MSE        =     .2275

---------------------------------------------------------------------------------
    annualstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |  -7.65e-06    .000043    -0.18   0.860     -.000096    .0000807
   medianincome |  -1.37e-07   1.39e-06    -0.10   0.922    -3.00e-06    2.72e-06
distancefromcal |  -.0979186   .1205411    -0.81   0.424    -.3456943    .1498572
        poccomp |   .4450206   .4718944     0.94   0.354    -.5249721    1.415013
  totalnumstops |   .1249761   .0000219  5709.13   0.000     .1249311    .1250211
          _cons |   .1907659    .307806     0.62   0.541    -.4419383    .8234701
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) append
\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults -.xls
dir : seeout

. 
end of do-file

. reg totalnumstops annualstops

      Source |       SS           df       MS      Number of obs   =        33
-------------+----------------------------------   F(1, 31)        >  99999.00
       Model |   150392938         1   150392938   Prob > F        =    0.0000
    Residual |  97.9297766        31  3.15902505   R-squared       =    1.0000
-------------+----------------------------------   Adj R-squared   =    1.0000
       Total |   150393036        32  4699782.38   Root MSE        =    1.7774

------------------------------------------------------------------------------
totalnumst~s |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
 annualstops |   8.001631   .0011597  6899.81   0.000     7.999266    8.003997
       _cons |  -.9268695   .4113814    -2.25   0.031    -1.765888   -.0878515
------------------------------------------------------------------------------

. corr totalnumstops annualstops
(obs=33)

             | totaln~s annual~s
-------------+------------------
totalnumst~s |   1.0000
 annualstops |   1.0000   1.0000


. corr annualstops poccomp
(obs=32)

             | annual~s  poccomp
-------------+------------------
 annualstops |   1.0000
     poccomp |   0.2017   1.0000


. do "C:\Users\KC1558~1\AppData\Local\Temp\19\STD1f18_000000.tmp"

. reg annualstops totalpop medianincome distancefromcal   //Model 1

      Source |       SS           df       MS      Number of obs   =        32
-------------+----------------------------------   F(3, 28)        =      3.00
       Model |  567134.499         3  189044.833   Prob > F        =    0.0472
    Residual |  1763613.38        28   62986.192   R-squared       =    0.2433
-------------+----------------------------------   Adj R-squared   =    0.1623
       Total |  2330747.88        31  75185.4153   Root MSE        =    250.97

---------------------------------------------------------------------------------
    annualstops |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
       totalpop |  -.0199356   .0468586    -0.43   0.674     -.115921    .0760499
   medianincome |  -.0028005   .0011261    -2.49   0.019    -.0051071   -.0004938
distancefromcal |   186.0569   100.5725     1.85   0.075    -19.95657    392.0705
          _cons |   358.1838   311.2022     1.15   0.259     -279.285    995.6526
---------------------------------------------------------------------------------

.         outreg2 using "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults `study'-`c_date'.xls", dec(3) alpha(0.001, 0.01, 0.05) symbol(***, **, *) replace
file \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Exports\census_lin_regResults -.xls is read-only; cannot be modified or erased
The file needs to be closed if being used by another software such as Excel.
r(608);

end of do-file

r(608);

. save "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\census_info_multilinear.dta", replace
file \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\census_info_multilinear.dta saved

. use "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded).dta"

. br

. sort dateofstop

. sum dateofstop

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  dateofstop |          0

. sum city

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
        city |          0

. tab city

       City |      Freq.     Percent        Cum.
------------+-----------------------------------
     ALBANY |          8        0.01        0.01
     Albany |         27        0.04        0.06
   BERKELEY |     52,989       86.74       86.79
   Berkeley |      8,053       13.18       99.98
     Dublin |          1        0.00       99.98
 EMERYVILLE |          1        0.00       99.98
 Emeryville |          6        0.01       99.99
    OAKLAND |          4        0.01      100.00
    Oakland |          3        0.00      100.00
------------+-----------------------------------
      Total |     61,092      100.00

. import delimited "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded) (2).csv", clear 
(67 vars, 61,702 obs)

. import delimited "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded) (2).csv", clear 
(67 vars, 61,702 obs)

. br

. br

. save "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta"
file \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta saved

. br

. *(1 variable, 61702 observations pasted into data editor)

. *(2 variables, 61702 observations pasted into data editor)

. save "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta", replace
file \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops_large(expanded)(2).dta saved

. clear all

. import delimited "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops(2).csv"
(63 vars, 6,926 obs)

. br

. drop distancefromcal 

. drop v1 

. drop dateofstop mm yyyy timeofstop durationofstop isstopmadeinresponsetocallforser informationbasedstop typeofstop officertypeofassignment location city islocationak12publicschool ifk12schoolisstopofastudent schoolname e
> ducationcodesection educationcodesubdivision raceperceivedpriortostop perceivedraceorethnicity gender perceivedgendernonconforming islgbt perceivedage personhadlimitedornoenglishfluen perceivedorknowndisability cityofres
> idence reasonforstop reasonforstopnarrative trafficviolationtype trafficviolationoffensecodes suspicionoffensecode suspicionsubtype actionstaken basisforsearch basisforsearchnarrative basisforpropertyseizure typeofproper
> tyseized contrabandorevidence othercontrabanddesc warningoffensecodes citationoffensecodes resultofstop infieldciteandreleaseoffensecode custodialarrestoffensecodes lat v44 censustract tract_medianincome tract_totalpop t
> ract_whitepop tract_nonwhitecomp tract_poccomp tract_nonwhitepop tract_pocpop tract_aapop tract_na_aipop tract_aisianpop tract_hawaiian tract_mixed2 tract_totalnumstops tract_annualstops tract_distancefromcal 

. *(61 variables, 8090 observations pasted into data editor)

. save "\\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops.dta", replace
file \\Client\C$\Users\kharr\Documents\GitHub\Berkeley-PD-ISF-110\Data\formatted_allstops.dta saved

. do "C:\Users\KC1558~1\AppData\Local\Temp\19\STD1f18_000000.tmp"

. *********CLASS PROJECT ISF 110*************
. *************By KC HARRIS *****************
. *******************************************
. clear all

. set more off

. capt log close
